# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [3]:
# 記得先 Import 正確的套件
import pandas as pd
import numpy as np

In [4]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [7]:
#- 計算每個不同種類 animal 的 age 的平均數
df.groupby('animal').age.mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [13]:
#- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
df.sort_values(by=['age','visits'])

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
b    cat  3.0       3      yes
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

In [20]:
#- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
df.priority.replace(to_replace=['yes','no'],value=['True','False'])

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: priority, dtype: object

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [21]:
df2 = pd.DataFrame(np.random.random(size=(5, 3)))
df2

          0         1         2
0  0.180325  0.120533  0.572053
1  0.856109  0.847003  0.903519
2  0.456633  0.897587  0.725071
3  0.063554  0.748455  0.354327
4  0.355043  0.438220  0.796111

In [25]:
df2-df2.mean(axis=0)

          0         1         2
0 -0.202008 -0.489827 -0.098163
1  0.473776  0.236643  0.233303
2  0.074300  0.287227  0.054854
3 -0.318778  0.138095 -0.315889
4 -0.027290 -0.172139  0.125895

In [28]:
df2.sub(df2.mean(axis=1),axis=0)

          0         1         2
0 -0.110645 -0.170437  0.281083
1 -0.012768 -0.021874  0.034642
2 -0.236464  0.204490  0.031974
3 -0.325224  0.359676 -0.034452
4 -0.174748 -0.091571  0.266319

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [30]:
df2

          0         1         2
0  0.180325  0.120533  0.572053
1  0.856109  0.847003  0.903519
2  0.456633  0.897587  0.725071
3  0.063554  0.748455  0.354327
4  0.355043  0.438220  0.796111

In [42]:
df2.sum(axis=1).argmin()

0

In [40]:
df2.sum(axis=0).argmin()

0